In [29]:
import numpy as np   # Numerical Python
import pandas as pd  # PANel DAtas

# Intro

# Series

In [49]:
labels = ["a", "b", "c",]
mylist = [10, 20, 30,]
arr = np.array([10, 20, 30])
d = {"a":10, "b":20, "c":30,}

In [50]:
print(pd.Series(data=mylist))
print(pd.Series(data=mylist, index=labels))
print(pd.Series(arr, labels))
print(pd.Series(data=d))

0    10
1    20
2    30
dtype: int64
a    10
b    20
c    30
dtype: int64
a    10
b    20
c    30
dtype: int64
a    10
b    20
c    30
dtype: int64

In [51]:
salesQ1 = pd.Series(data=[250, 450, 200, 150], index=["USA", "China", "India", "Brazil"])
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [52]:
salesQ2 = pd.Series(data=[260, 500, 210, 100], index=["USA", "China", "India", "Japan"])
salesQ2

USA      260
China    500
India    210
Japan    100
dtype: int64

In [53]:
print(salesQ2["China"])
print(salesQ2.iloc[1])

500
500

In [54]:
salesQ1 + salesQ2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

# Dataframes - 1

In [55]:
columns = ["W", "X", "Y", "Z"]
index = ["A", "B", "C", "D", "E"]
from numpy.random import randint
np.random.seed(42)
data = randint(-100, 100, (5,4))
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [56]:
df = pd.DataFrame(data=data, index=index, columns=columns)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

#### Working with columns

In [45]:
df["W"]

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [46]:
df[["W", "Z"]]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [47]:
df["new"] = df["W"] + df["Y"]
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [48]:
df.drop("new", axis=1) # axis=1 look for columns
print(df)
df = df.drop("new", axis=1) # axis=1 look for columns
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [ ]:
#### Working with rows

In [57]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [58]:
df.loc[["A", "E"]]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [61]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [62]:
df.drop("C", axis=0)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [64]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [65]:
df.loc["A", "W"]

np.int64(2)

In [66]:
df.loc[["A","C"], ["W", "Y"]]

   W   Y
A  2  -8
C  2 -26

# Dataframes - 2

In [67]:
labels = ["a", "b", "c",]
mylist = [10, 20, 30,]
arr = np.array([10, 20, 30])
d = {"a":10, "b":20, "c":30,}
df = pd.DataFrame(data=data, index=index, columns=columns)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [68]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [69]:
df[df > 0]  # Missing data

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [70]:
df["X"]>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [71]:
df[df["X"]>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [72]:
df[df["X"]>0]["W"]  # with column sleection

A     2
C     2
E    30
Name: W, dtype: int64

In [73]:
df[df["X"]>0].iloc[0]  # with index selection

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [75]:
(df["W"]>0) & (df["Y"]>1)  # Put the condition in brackets

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [76]:
df[(df["W"]>0) & (df["Y"]>1)]  # Apply the selector to the df

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [77]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [79]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [84]:
new_index = ["CA", "NY", "WY", "OR", "CO"]
df["states"] = new_index
df

    W   X   Y   Z states
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [85]:
df.set_index("states")  # States is now the name of the index

         W   X   Y   Z
states
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [86]:
df

    W   X   Y   Z states
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

#### Missing Data

In [87]:
import pandas as pd
import numpy as np

In [88]:
df = pd.DataFrame(
    {
        "A": [1, 2, np.nan, 4],
        "B": [5, np.nan, np.nan, 8],
        "C": [10, 20, 30, 40]
    }
)
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [89]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [90]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [91]:
df.dropna(axis=1, thresh=2)  # thresh at least so many must be non-null

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [92]:
df.dropna(axis=1, thresh=3) # thresh at least so many must be non-null

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [93]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [94]:
df.fillna(value="FILL VALUE")

            A           B   C
0         1.0         5.0  10
1         2.0  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3         4.0         8.0  40

In [95]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [96]:
df["A"].fillna(value="XX")

0    1.0
1    2.0
2     XX
3    4.0
Name: A, dtype: object

In [97]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [98]:
df["B"].mean()

np.float64(6.5)

In [99]:
df["B"].fillna(df["B"].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

#### GroupBy
also known as: Split apply combine
split into categorie,
apply the aggregate function to each category
recombine back to get the result(per category)

In [1]:
import pandas as pd

In [4]:
# We will cover reading in data in a lot more detail in a later lecture!
df = pd.read_csv('Universities.csv')
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [8]:
df.groupby("Year").sum()

,Sector,University,Completions,Geography
Year,,,,
2012,"Private for-profit, less-than 2-yearPrivate fo...",Academy of Hair Design-Las VegasCareer College...,20333,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2013,"Private for-profit, 2-yearPrivate for-profit, ...",Aviation Institute of Maintenance-Las VegasDeV...,21046,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2014,"Private not-for-profit, 4-year or abovePrivate...",Roseman University of Health SciencesExpertise...,24730,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2015,"Private for-profit, 2-yearPrivate not-for-prof...",Pima Medical Institute-Las VegasRoseman Univer...,26279,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2016,"Private for-profit, 2-yearPrivate for-profit, ...",Pima Medical Institute-Las VegasHealthcare Pre...,26224,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...

In [20]:
# df.groupby("Year").mean() # does not work
# Here we must filter out the columns that are not dtype==object
df.filter(items=["Year", "Completions"]).groupby('Year').mean().sort_index(ascending=False)

      Completions
Year
2016   609.860465
2015   597.250000
2014   588.809524
2013   526.150000
2012   535.078947

#### Operations

In [21]:
import pandas as pd
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [22]:
# Unique values
df_one["col2"].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [23]:
df_one["col2"].nunique()

5

In [24]:
df_one["col2"].value_counts()

col2
WA    2
NY    1
CA    1
AK    1
NV    1
Name: count, dtype: int64

In [25]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [26]:
df_one["NEW"] = df_one["col1"] * 10
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [27]:
def grab_first_letter(state):
    return state[0]

grab_first_letter("WA")

'W'

In [28]:
df_one["col2"].apply(grab_first_letter)

0    N
1    C
2    W
3    W
4    A
5    N
Name: col2, dtype: object

In [29]:
df_one["first_letter"] = df_one["col2"].apply(grab_first_letter)

In [30]:
df_one

  k1  col1 col2   NEW first_letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [31]:
def complex_letter(state):
    if state[0] == "W":
        return "Washington"
    else:
        return "Error"

df_one["col2"].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [32]:
df_one["col1"].apply(complex_letter) # gives a type error

TypeError: 'int' object is not subscriptable

In [33]:
df_one["k1"]

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [36]:
my_map = {"A": 1, "B":2, "C":3, "D": 4, "E":5}

df_one["k1"].map(my_map)

0    1
1    1
2    2
3    2
4    3
5    3
Name: k1, dtype: int64

In [35]:
df_one

  k1  col1 col2   NEW first_letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [37]:
df_one["col1"].max()

np.int64(500)

In [38]:
df_one["col1"].idxmax()

5

In [39]:
df_one["col1"].idxmin()

0

In [40]:
df_one.columns = ["c1", "c2", "c3", "c4", "c5"]
df_one

  c1   c2  c3    c4 c5
0  A  100  NY  1000  N
1  A  200  CA  2000  C
2  B  300  WA  3000  W
3  B  300  WA  3000  W
4  C  400  AK  4000  A
5  C  500  NV  5000  N

In [42]:
df_one.sort_values("c3", ascending=False)

  c1   c2  c3    c4 c5
2  B  300  WA  3000  W
3  B  300  WA  3000  W
0  A  100  NY  1000  N
5  C  500  NV  5000  N
1  A  200  CA  2000  C
4  C  400  AK  4000  A

In [43]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [44]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [45]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [46]:
pd.concat([features, predictions])  # implicit axis=0

       A     B  pred
0  100.0  12.0   NaN
1  200.0  13.0   NaN
2  300.0  14.0   NaN
3  400.0  15.0   NaN
4  500.0  16.0   NaN
0    NaN   NaN   0.0
1    NaN   NaN   1.0
2    NaN   NaN   1.0
3    NaN   NaN   0.0
4    NaN   NaN   1.0

In [47]:
pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [48]:
df_one

  c1   c2  c3    c4 c5
0  A  100  NY  1000  N
1  A  200  CA  2000  C
2  B  300  WA  3000  W
3  B  300  WA  3000  W
4  C  400  AK  4000  A
5  C  500  NV  5000  N

In [49]:
df_one["c1"]

0    A
1    A
2    B
3    B
4    C
5    C
Name: c1, dtype: object

In [51]:
pd.get_dummies(df_one["c1"]).astype(int)

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

#### Input and Output